'use strict';

/*
Теоретичні питання
1. Що таке оператори в JavaScript і які їхні типи ви знаєте?

Оператори - знаки операції. Є оператори присвоєння, порівняння, арифметичні, строкові, логічні, унарні, бінарні, тернарний.

2. Для чого використовуються оператори порівняння в JavaScript? Наведіть приклади таких операторів.

Оператори порівняння перетворюють значення змінних до одного типу даних, який можна порівняти, порівнюють та повертають логічне значення true або false. Строга рівність/нерівність порівнює спочатку тип даних значення, якщо однакові, то перевіряє значення, в протилежному випадку повертає false.

>, < - більше, менше;
>=, <= - більше або дорівнює, менше або дорівнює;
==, != - дорівнює, не дорівнює (з призведенням значень до типу даних, що можна порівняти);
===, !== - суворе дорівнює, суворе не дорівнює

3. Що таке операції присвоєння в JavaScript? Наведіть кілька прикладів операцій присвоєння.

Операції присвоєння використовуються для визначення/зміни значеня в змінній за допомогою оператора присвоєння "=".

let age = 43; // присвоєння значення змінній age
age += 1; // присвоєння нового значення змінній age яке збільшується на 1
age = ++age; // присвоєння нового значення змінній age яке збільшується на 1 за допомогою інкремента
*/

/*
Практичні завдання
1. Створіть змінну "username" і присвойте їй ваше ім'я. Створіть змінну "password" і присвойте їй пароль (наприклад, "secret"). Далі ми імітуємо введеня паролю користувачем. Отримайте від користувача значення його паролю і перевірте, чи співпадає воно зі значенням в змінній "password". Виведіть результат порівнння в консоль.*/

const userName = 'Олексій';
const password = 'secret';
const userPassword = prompt('Введіть пароль');

if (userPassword === password) {
	console.log(`${userName}, пароль вірний!`);
} else {
	console.log(`${userName}, введіть правильний пароль`);
}

const passwordVerification = userPassword === password ?
	`${userName}, пароль вірний!` :
	`${userName}, введіть правильний пароль`;
console.log(passwordVerification);

/*
2. Створіть змінну x та присвойте їй значення 5. Створіть ще одну змінну y та запишіть присвойте їй значення 3. 
Виведіть результати додавання, віднімання, множення та ділення змінних x та y у вікні alert.
*/

const x = 5;
const y = 3;

alert(x + y);
alert(x - y);
alert(x * y);
alert(x / y);